[
  {
    "id": "gallipoli-1915",
    "room": "liberation",
    "year": 1915,
    "title": {
      "en": "The Gallipoli Campaign",
      "tr": "Çanakkale Savaşı"
    },
    "body": {
      "en": "The defense of Gallipoli became a turning point in modern Turkish history. Under extraordinary leadership, the Ottoman forces successfully defended the peninsula against a massive allied invasion.\n\nThe victory at Gallipoli was not just a military triumph, but a demonstration of national will and determination. It united people from all backgrounds in defense of their homeland.\n\nThis campaign established the foundations of leadership that would later guide the nation to independence.",
      "tr": "Çanakkale’nin savunması modern Türk tarihinin dönüm noktalarından biri oldu. Olağanüstü bir liderlik altında Osmanlı kuvvetleri, büyük bir müttefik çıkarmasına karşı yarımadayı başarıyla savundu.\n\nÇanakkale’deki zafer yalnızca askerî bir başarı değil; milli irade ve kararlılığın da bir göstergesiydi. İnsanları vatanlarını savunma ortak paydasında birleştirdi.\n\nBu harekât, ileride ulusu bağımsızlığa taşıyacak liderliğin temellerini attı."
    },
    "imageUrl": "https://images.pexels.com/photos/14944816/pexels-photo-14944816.jpeg"
  },
  {
    "id": "samsun-1919",
    "room": "liberation",
    "year": 1919,
    "title": {
      "en": "Departure to Samsun",
      "tr": "Samsun’a Çıkış"
    },
    "body": {
      "en": "On May 19, 1919, a decisive turn towards national independence began. This journey marked the start of an organized resistance movement that would change the course of history.\n\nThe landing at Samsun represented more than a geographical move—it was the beginning of a new era. It symbolized hope and determination in the face of occupation.\n\nFrom this moment, the foundations were laid for a national struggle that would inspire millions and lead to the birth of a new nation.",
      "tr": "19 Mayıs 1919’da ulusal bağımsızlığa doğru kararlı bir yöneliş başladı. Bu seyahat, tarihin akışını değiştirecek örgütlü direnişin başlangıcını simgeledi.\n\nSamsun’a çıkış, coğrafi bir hareketten çok daha fazlasıydı—yeni bir çağın başlangıcıydı. İşgal karşısında umut ve kararlılığın sembolü oldu.\n\nBu andan itibaren, milyonlara ilham verecek ve yeni bir ulusun doğuşuna yol açacak millî mücadelenin temelleri atıldı."
    },
    "imageUrl": "https://images.pexels.com/photos/3568518/pexels-photo-3568518.jpeg"
  },
  {
    "id": "congress-1919",
    "room": "liberation",
    "year": 1919,
    "title": {
      "en": "National Congresses",
      "tr": "Millî Kongreler"
    },
    "body": {
      "en": "The Erzurum and Sivas Congresses established the principles of the national movement. Representatives from across the nation gathered to define their common goals and strategy.\n\nThese congresses demonstrated the unity of purpose among the Turkish people. They declared that the nation's will was supreme and that foreign occupation would not be accepted.\n\nThe decisions made in these gatherings became the foundation for the Grand National Assembly and the independence struggle.",
      "tr": "Erzurum ve Sivas Kongreleri, millî hareketin ilkelerini belirledi. Ülkenin dört bir yanından gelen temsilciler ortak hedef ve stratejileri tanımlamak için toplandı.\n\nBu kongreler, Türk halkının amaç birliği içinde olduğunu gösterdi. Millet iradesinin üstünlüğü vurgulandı ve yabancı işgalin asla kabul edilmeyeceği ilan edildi.\n\nAlınan kararlar, Büyük Millet Meclisi’nin ve bağımsızlık mücadelesinin temelini oluşturdu."
    },
    "imageUrl": "https://images.pexels.com/photos/8761732/pexels-photo-8761732.jpeg"
  },
  {
    "id": "assembly-1920",
    "room": "liberation",
    "year": 1920,
    "title": {
      "en": "Opening of the Grand National Assembly",
      "tr": "Büyük Millet Meclisi’nin Açılışı"
    },
    "body": {
      "en": "On April 23, 1920, the Grand National Assembly opened in Ankara, establishing a new seat of sovereignty. This was a revolutionary act—creating a legitimate government while under occupation.\n\nThe Assembly represented the will of the nation and became the heart of the independence struggle. It made critical decisions on both military and political fronts.\n\nThis institution would guide the nation through its darkest hours and emerge victorious, establishing true national sovereignty.",
      "tr": "23 Nisan 1920’de Ankara’da Büyük Millet Meclisi açıldı ve yeni bir egemenlik merkezi kuruldu. Bu, işgal şartları altında meşru bir yönetimin inşası anlamına gelen devrimci bir adımdı.\n\nMeclis, milletin iradesini temsil etti ve bağımsızlık mücadelesinin kalbi oldu. Askerî ve siyasî cephelerde kritik kararlar aldı.\n\nBu kurum, en zor zamanlarda millete rehberlik etti ve gerçek ulusal egemenliği tesis ederek zaferle çıktı."
    },
    "imageUrl": "https://images.pexels.com/photos/7942986/pexels-photo-7942986.jpeg"
  },
  {
    "id": "victory-1922",
    "room": "liberation",
    "year": 1922,
    "title": {
      "en": "The Great Victory",
      "tr": "Büyük Zafer"
    },
    "body": {
      "en": "The decisive military victory in August 1922 ended the War of Independence. Years of strategic planning and sacrifice culminated in the liberation of Anatolia.\n\nThe Great Victory proved that a determined nation could overcome any obstacle. It demonstrated the power of unified leadership and national resolve.\n\nWith the victory came independence, and the path was cleared for building a new state based on national sovereignty and modern principles.",
      "tr": "Ağustos 1922’de kazanılan kesin askerî zafer, Kurtuluş Savaşı’nı sona erdirdi. Yıllarca süren stratejik planlama ve fedakârlık, Anadolu’nun kurtuluşuyla taçlandı.\n\nBüyük Zafer, kararlı bir ulusun her engeli aşabileceğini kanıtladı. Birleşik liderliğin ve millî kararlılığın gücünü ortaya koydu.\n\nZaferle birlikte bağımsızlık geldi ve ulusal egemenlik ile modern ilkelere dayanan yeni bir devletin inşası için yol açıldı."
    },
    "imageUrl": "https://images.pexels.com/photos/5699459/pexels-photo-5699459.jpeg"
  },
  {
    "id": "proclamation-1923",
    "room": "republic",
    "year": 1923,
    "title": {
      "en": "Proclamation of the Republic",
      "tr": "Cumhuriyetin İlanı"
    },
    "body": {
      "en": "On October 29, 1923, the Republic of Türkiye was officially proclaimed. This marked the end of the Ottoman Empire and the beginning of a new era in Turkish history.\n\nThe new republic was founded on principles of national sovereignty, democracy, and modernization. It represented a complete transformation of the state structure and governance.\n\nThis moment changed the course of Turkish history forever, establishing a modern nation-state that would serve as a model for other nations seeking independence.",
      "tr": "29 Ekim 1923’te Türkiye Cumhuriyeti resmen ilan edildi. Bu gelişme, Osmanlı İmparatorluğu’nun sonunu ve Türk tarihinde yeni bir dönemin başlangıcını ifade ediyordu.\n\nYeni cumhuriyet; ulusal egemenlik, demokrasi ve modernleşme ilkeleri üzerine kuruldu. Devlet yapısında ve yönetimde köklü bir dönüşümü temsil etti.\n\nBu an, Türk tarihinin akışını kalıcı biçimde değiştirdi ve bağımsızlık arayışındaki diğer uluslara örnek olacak modern bir ulus-devlet kurdu."
    },
    "imageUrl": "https://images.pexels.com/photos/9853998/pexels-photo-9853998.jpeg"
  },
  {
    "id": "capital-1923",
    "room": "republic",
    "year": 1923,
    "title": {
      "en": "Ankara Becomes the Capital",
      "tr": "Ankara’nın Başkent Oluşu"
    },
    "body": {
      "en": "Ankara was officially declared the capital of the new republic. This decision symbolized a break from the imperial past and a commitment to building a new national identity.\n\nThe choice of Ankara, a city in the heart of Anatolia, represented the democratic nature of the new state. It was the city where the national struggle was organized and led.\n\nFrom a small town, Ankara would grow into a modern capital, embodying the spirit of transformation and progress.",
      "tr": "Ankara, yeni cumhuriyetin başkenti olarak resmen ilan edildi. Bu karar, imparatorluk geçmişinden kopuşu ve yeni bir ulusal kimlik inşa etme kararlılığını simgeliyordu.\n\nAnadolu’nun kalbindeki bir şehir olan Ankara’nın tercih edilmesi, yeni devletin demokratik karakterini yansıtıyordu. Millî mücadelenin organize edildiği ve yürütüldüğü şehirdi.\n\nKüçük bir kasabadan modern bir başkente dönüşen Ankara, dönüşüm ve ilerleme ruhunu somutlaştırdı."
    },
    "imageUrl": "https://images.pexels.com/photos/5137986/pexels-photo-5137986.jpeg"
  },
  {
    "id": "constitution-1924",
    "room": "republic",
    "year": 1924,
    "title": {
      "en": "The 1924 Constitution",
      "tr": "1924 Anayasası"
    },
    "body": {
      "en": "The new constitution established the legal framework for the republic. It enshrined principles of national sovereignty, democracy, and equality before the law.\n\nThis constitution represented a radical departure from the past, establishing a modern legal system based on contemporary principles. It defined the structure of government and the rights of citizens.\n\nThe constitutional order laid the foundation for further reforms and modernization efforts that would transform Turkish society.",
      "tr": "Yeni anayasa, cumhuriyetin hukukî çerçevesini oluşturdu. Ulusal egemenlik, demokrasi ve kanun önünde eşitlik ilkelerini güvence altına aldı.\n\nBu anayasa, geçmişten radikal bir kopuşu temsil ederek çağdaş ilkelere dayalı modern bir hukuk sistemi kurdu. Devletin yapısını ve vatandaşların haklarını tanımladı.\n\nAnayasal düzen, Türk toplumunu dönüştürecek yeni reformlar ve modernleşme hamleleri için temel oluşturdu."
    },
    "imageUrl": "https://images.pexels.com/photos/5668837/pexels-photo-5668837.jpeg"
  },
  {
    "id": "education-reform",
    "room": "reforms",
    "year": 1924,
    "title": {
      "en": "Education Reform",
      "tr": "Eğitim Devrimi"
    },
    "body": {
      "en": "The unification of education under a single system was revolutionary. All schools were brought under state control, ensuring standardized, secular education for all citizens.\n\nEducation was seen as the key to modernization and progress. The new system emphasized science, critical thinking, and preparing citizens for the modern world.\n\nThis reform democratized access to knowledge and created opportunities for all citizens, regardless of background, to receive quality education.",
      "tr": "Eğitimin tek bir çatı altında birleştirilmesi devrim niteliğindeydi. Tüm okullar devlet denetimine alındı ve tüm vatandaşlar için standart, laik eğitim sağlandı.\n\nEğitim, modernleşme ve ilerlemenin anahtarı olarak görüldü. Yeni sistem; bilimi, eleştirel düşünmeyi ve vatandaşların modern dünyaya hazırlanmasını öne çıkardı.\n\nBu reform, bilgiye erişimi demokratikleştirerek her kesimden vatandaşın nitelikli eğitime ulaşması için fırsatlar yarattı."
    },
    "imageUrl": "https://images.pexels.com/photos/5905857/pexels-photo-5905857.jpeg"
  },
  {
    "id": "alphabet-reform",
    "room": "reforms",
    "year": 1928,
    "title": {
      "en": "Alphabet Revolution",
      "tr": "Harf Devrimi"
    },
    "body": {
      "en": "The adoption of the Latin alphabet was one of the most dramatic reforms. It replaced the Arabic script, making literacy more accessible and connecting Türkiye with the Western world.\n\nThis change was implemented rapidly, with intensive national education campaigns. The goal was to increase literacy rates and facilitate communication and learning.\n\nThe alphabet reform symbolized the commitment to modernization and opened new horizons for education, science, and cultural exchange.",
      "tr": "Latin alfabesinin kabulü, en çarpıcı reformlardan biriydi. Arap alfabesinin yerini alarak okuryazarlığı daha erişilebilir kıldı ve Türkiye’yi Batı dünyasıyla buluşturdu.\n\nBu değişim, yoğun ulusal eğitim seferberlikleriyle hızla hayata geçirildi. Amaç, okuryazarlık oranlarını artırmak; iletişimi ve öğrenmeyi kolaylaştırmaktı.\n\nHarf devrimi, modernleşme kararlılığını simgeledi ve eğitim, bilim ile kültürel etkileşim için yeni ufuklar açtı."
    },
    "imageUrl": "https://images.pexels.com/photos/256417/pexels-photo-256417.jpeg"
  },
  {
    "id": "womens-rights",
    "room": "reforms",
    "year": 1934,
    "title": {
      "en": "Women's Rights",
      "tr": "Kadın Hakları"
    },
    "body": {
      "en": "Women gained the right to vote and be elected to parliament in 1934, making Türkiye one of the first countries to grant full political rights to women.\n\nThis was part of a broader effort to ensure gender equality in all aspects of society. Women were encouraged to pursue education, professional careers, and take active roles in public life.\n\nThe reforms in women's rights were revolutionary for the time and demonstrated the commitment to building a modern, egalitarian society.",
      "tr": "Kadınlar 1934’te oy kullanma ve milletvekili seçilme haklarını elde etti; Türkiye’yi kadınlara tam siyasal haklar tanıyan ilk ülkelerden biri yaptı.\n\nBu adım, toplumun her alanında cinsiyet eşitliğini sağlamaya yönelik daha geniş bir çabanın parçasıydı. Kadınlar eğitim ve meslek edinmeye teşvik edildi; kamusal yaşamda etkin roller üstlenmeleri desteklendi.\n\nKadın haklarındaki reformlar dönemi için devrim niteliğindeydi ve modern, eşitlikçi bir toplum inşa etme kararlılığını gösterdi."
    },
    "imageUrl": "https://images.pexels.com/photos/3184418/pexels-photo-3184418.jpeg"
  },
  {
    "id": "legal-reform",
    "room": "reforms",
    "year": 1926,
    "title": {
      "en": "Legal Reforms",
      "tr": "Hukuk Reformları"
    },
    "body": {
      "en": "The adoption of modern civil, criminal, and commercial codes transformed the legal system. These codes were based on contemporary European models and established equality before the law.\n\nThe new legal framework abolished religious courts and established a secular justice system. It guaranteed individual rights and freedoms, establishing the rule of law.\n\nThese reforms modernized social relations and brought Türkiye's legal system in line with contemporary international standards.",
      "tr": "Modern medeni, ceza ve ticaret kanunlarının kabulü hukuk sistemini dönüştürdü. Bu kanunlar, çağdaş Avrupa modellerine dayanarak kanun önünde eşitliği tesis etti.\n\nYeni hukuk düzeni, şer’î mahkemeleri kaldırdı ve laik bir adalet sistemi kurdu. Bireysel hak ve özgürlükleri güvence altına alarak hukuk devletini tesis etti.\n\nBu reformlar, toplumsal ilişkileri modernize etti ve Türkiye’nin hukuk sistemini çağdaş uluslararası standartlarla uyumlu hale getirdi."
    },
    "imageUrl": "https://images.pexels.com/photos/8111851/pexels-photo-8111851.jpeg"
  }
]
